## Who Reverts Whom?

If $i$ reverts article to version 25 then $i$ reverts the editor who made the edit immediately after edit 25.

Thus, in this example, *Danny* reverted *Ezra_Wax*.

In [292]:
import pandas as pd
import math as mt
import numpy as np

In [2]:
df = pd.read_csv("enwiki_2002.txt", sep = '\t', parse_dates=['time'])

In [3]:
df.head()

,title,time,revert,version,user
0,Industrial_revolution,2002-02-25 15:51:15,0,2,Conversion_script
1,Industrial_revolution,2001-08-17 14:14:23,0,1,Koyaanis_Qatsi
2,Spitfire_(disambiguation),2002-06-20 13:00:32,0,2,Uriyan
3,Spitfire_(disambiguation),2002-02-25 15:43:11,0,1,Conversion_script
4,Supermarine_Spitfire,2002-12-24 13:09:25,0,29,Tannin

In [5]:
df.shape

(567285, 5)

In [6]:
## higher border, value
df['revert'].sum()

10380

In [7]:
df[df['revert'] == 1].head()

                         title                time  revert  version       user
12       Supermarine_Spitfire  2002-06-20 13:01:19       1       21     Uriyan
35   Jesus_College,_Cambridge  2002-10-23 13:34:06       1        2  Willsmith
109               Bubble_sort  2002-11-13 21:58:59       1       17       FvdP
110               Bubble_sort  2002-11-13 21:53:17       1       16       FvdP
137                      Jews  2002-11-03 04:28:10       1       25      Danny

In [154]:
list_of_reversions = df[df['revert'] == 1].index.tolist()
list_of_reversions[:9]

[12, 35, 109, 110, 137, 153, 159, 163, 222]

In [9]:
df.iloc[11:15,]

,title,time,revert,version,user
11,Supermarine_Spitfire,2002-09-03 06:02:42,0,22,62.253.64.7
12,Supermarine_Spitfire,2002-06-20 13:01:19,1,21,Uriyan
13,Supermarine_Spitfire,2002-06-20 12:59:27,0,21,Maury_Markowitz
14,Supermarine_Spitfire,2002-06-20 12:58:00,0,20,Maury_Markowitz

In [10]:
df.iloc[33:38]

,title,time,revert,version,user
33,Supermarine_Spitfire,2001-06-15 17:48:03,0,1,WojPob
34,Jesus_College,2002-10-23 13:26:19,0,1,Willsmith
35,"Jesus_College,_Cambridge",2002-10-23 13:34:06,1,2,Willsmith
36,"Jesus_College,_Cambridge",2002-02-25 15:51:15,0,3,Conversion_script
37,"Jesus_College,_Cambridge",2001-12-06 08:00:09,0,2,Bryan_Derksen

In [12]:
df.iloc[107:120]

            title                time  revert  version            user
107  Bubble_sort  2002-12-18 21:15:26       0       19       AxelBoldt
108  Bubble_sort  2002-12-18 08:11:28       0       18            Isis
109  Bubble_sort  2002-11-13 21:58:59       1       17            FvdP
110  Bubble_sort  2002-11-13 21:53:17       1       16            FvdP
111  Bubble_sort  2002-11-13 21:48:57       0       17        Jmallios
112  Bubble_sort  2002-11-13 20:59:59       0       16  198.214.36.133
113  Bubble_sort  2002-11-13 20:58:03       0       15  198.214.36.133
114  Bubble_sort  2002-11-04 20:29:46       0       14  198.214.36.133
115  Bubble_sort  2002-10-08 14:30:56       0       13       AxelBoldt
116  Bubble_sort  2002-10-07 10:31:26       0       12        Jeronimo
117  Bubble_sort  2002-10-07 10:25:44       0       11            Isis
118  Bubble_sort  2002-09-06 17:40:43       0       10    Andre_Engels
119  Bubble_sort  2002-03-23 23:55:54       0        9            Hari

---
apply to all data  

---

In [165]:
## Non-Active
#list_reverts = df[df['revert'] == 1][['title','version','user']].values.tolist()

In [234]:
#Active
list_reverts = df[df['revert'] == 1][['title','version']].values.tolist()

In [235]:
list_reverts[48:55]

[['Aluminum ', 5],
 ['Aluminum ', 4],
 ['Aluminum ', 5],
 ['Aluminum ', 4],
 ['Larry_Sanger ', 1],
 ['Nobel_Prize_in_Chemistry ', 14],
 ['Nobel_Prize_in_Chemistry ', 12]]

In [236]:
len(list_reverts)

10380

In [191]:
## NON- ACTIVE
#index_list1 = []
#for i in range(100):
#    indexex = df[(df['title'] == list_reverts[i][0]) & (df['version'] == list_reverts[i][1])].index.tolist()
#   indexex[1] = indexex[1] - 1
#    index_list1.append(indexex)

In [237]:
index_list = []
for i in range(len(list_reverts)):
    indexex = df[(df['title'] == list_reverts2[i][0]) & (df['version'] == list_reverts2[i][1]) & (df['revert'] == 0)].index - 1
    index_list.append(indexex.tolist())

In [156]:
df.iloc[300:310]

                   title                time  revert  version             user
300  Slobodan_Milošević  2002-11-27 00:33:03       0       30  194.117.133.118
301  Slobodan_Milošević  2002-11-27 00:32:00       0       29            Zocky
302  Slobodan_Milošević  2002-11-27 00:25:31       1       28  194.117.133.118
303  Slobodan_Milošević  2002-11-27 00:23:28       1       25            Zocky
304  Slobodan_Milošević  2002-11-27 00:21:35       0       28          Tinulim
305  Slobodan_Milošević  2002-11-27 00:20:19       0       27        Eloquence
306  Slobodan_Milošević  2002-11-27 00:16:03       1       26          Tinulim
307  Slobodan_Milošević  2002-11-27 00:13:40       1       25  194.117.133.118
308  Slobodan_Milošević  2002-11-27 00:11:05       0       26          Tinulim
309  Slobodan_Milošević  2002-11-26 23:54:52       0       25    193.2.132.120

In [186]:
df.iloc[1748:1756]

              title                time  revert  version            user
1748  MSC_Malaysia  2002-10-18 12:56:20       0        2       Willsmith
1749  MSC_Malaysia  2002-10-18 11:36:55       0        1       Willsmith
1750      Aluminum  2002-12-27 03:21:09       1        5       Camembert
1751      Aluminum  2002-12-27 02:54:25       1        4            Isis
1752      Aluminum  2002-12-27 02:35:20       1        5  64.229.101.208
1753      Aluminum  2002-12-27 01:15:03       1        4            Isis
1754      Aluminum  2002-12-27 00:39:50       0        5             Mav
1755      Aluminum  2002-12-27 00:34:38       0        4            Isis

In [210]:
index_list[:10]

[[12], [36], [110], [111], [138], [153], [160], [164], [222], [228]]

In [239]:
flat_list = [item for sublist in index_list for item in sublist]
flat_list[:6]
#df.loc[flat_list]['user'].tolist()

[12, 36, 110, 111, 138, 153]

In [241]:
df_revert = pd.DataFrame({'Time' : df[df['revert'] == 1]['time'].tolist(), 
                          'Reverter' : df[df['revert'] == 1]['user'].tolist(),
                          'Reverted' : df.loc[flat_list]['user'].tolist() })

In [243]:
df_revert.tail()

           Reverted      Reverter                Time
10375  66.156.88.47         Graft 2002-10-01 03:17:16
10376           Lir           Mav 2002-09-28 07:31:49
10377           Mav           Lir 2002-09-28 07:30:37
10378           Lir           Mav 2002-09-28 07:15:02
10379  206.82.16.35  206.82.16.35 2002-04-02 09:54:12

In [197]:
df.iloc[225:230]

            title                time  revert  version        user
225  Coup_d'état  2002-04-16 13:47:31       0       15   DanKeshet
226  Coup_d'état  2002-04-16 05:08:14       0       14    Hellbent
227  Coup_d'état  2002-04-15 17:54:27       1       12  Roadrunner
228  Coup_d'état  2002-04-15 15:50:17       0       13    Hellbent
229  Coup_d'état  2002-04-12 14:40:03       0       12  Roadrunner

In [254]:
df_revert_final = df_revert[df_revert['Reverter'] != df_revert['Reverted']].reset_index(drop = True)

In [261]:
df_revert_final.head()

            Reverted        Reverter                Time
0  Conversion_script       Willsmith 2002-10-23 13:34:06
1           Jmallios            FvdP 2002-11-13 21:53:17
2           Ezra_Wax           Danny 2002-11-03 04:28:10
3         209.7.11.9  Koyaanis_Qatsi 2002-05-01 12:19:10
4    209.240.222.xxx        Dmerrill 2001-12-31 19:14:41

In [262]:
df.head()

,title,time,revert,version,user
0,Industrial_revolution,2002-02-25 15:51:15,0,2,Conversion_script
1,Industrial_revolution,2001-08-17 14:14:23,0,1,Koyaanis_Qatsi
2,Spitfire_(disambiguation),2002-06-20 13:00:32,0,2,Uriyan
3,Spitfire_(disambiguation),2002-02-25 15:43:11,0,1,Conversion_script
4,Supermarine_Spitfire,2002-12-24 13:09:25,0,29,Tannin

In [303]:
df.head()

,title,time,revert,version,user,mention
0,Industrial_revolution,2002-02-25 15:51:15,0,2,Conversion_script,1
1,Industrial_revolution,2001-08-17 14:14:23,0,1,Koyaanis_Qatsi,1
2,Spitfire_(disambiguation),2002-06-20 13:00:32,0,2,Uriyan,1
3,Spitfire_(disambiguation),2002-02-25 15:43:11,0,1,Conversion_script,1
4,Supermarine_Spitfire,2002-12-24 13:09:25,0,29,Tannin,1

In [313]:
def get_status2(date, user):

    searching_df = len(df[(df['user'] == user) & (df['time'] <= date)])
    
    return mt.log10(searching_df)

In [335]:
df_revert_final['Status_Reverter'] = df_revert_final.apply(lambda row: get_status2(row.Time, row.Reverter), axis=1)

In [336]:
df_revert_final['Status_Reverted'] = df_revert_final.apply(lambda row: get_status2(row.Time, row.Reverted), axis=1)

In [314]:
get_status2(df_revert_final.loc[0,'Time'], df_revert_final.loc[0,'Reverter'])

2.3364597338485296

In [309]:
 get_status2(df_revert_final['Time'], row['Reverter'])

ValueError: Can only compare identically-labeled Series objects

In [299]:
#List_status_reverter = []
# go thorugh all the cols and calculate
#for index, row in df_revert_final.iterrows():
#    List_status_reverter.append(get_status(row['Time'], row['Reverter']))

In [338]:
df_revert_final.to_csv('edges.csv')

In [340]:
import pickle
with open ('edges_df', 'wb') as fw:
    pickle.dump(df_revert_final, fw)